# Amharic
texts = {
    'welcome': "🎉 እንኳን ወደ Linebet አሊፊኤት ፕሮግራም በደህና መጡ! 🎉",
    'language_prompt': "እባኮትን ቋንቋዎትን ይምረጡ:",
    'main_menu_prompt': "አማራጭ ይምረጡ:",
        'languages': [
        ['🇬🇧 English', '🇫🇷 Français', '🇦🇪 العربية'],
        ['🇷🇺 Русский', '🇮🇷 فارسی', '🇰🇪 Kiswahili'],
        ['🇳🇬 Hausa', '🇪🇹 አማርኛ', '🇿🇦 isiZulu'],
        ['🇳🇬 Igbo']
    ],
    'registration_choice': "እንዴት መመዝገብ ትፈልጋለህ?\n\n"
                           "🌐 *በራስህ መመዝገብ*: መመዝገብ ለማስቻል አገናኝ እናቀርብልሃለን።\n"
                           "🤖 *መዝግብ እስከ እስከ እንደጎን*: እዚህ ዝርዝሮችህን እንዲያስተላልፍ፣ እኛም እናመዝግብልሃለን።",
    'button_register_manually': "🌐 በራስህ መመዝገብ",
    'button_register_step': "🤖 መዝግብ እስከ እስከ እንደጎን",
    'ask_first_name': "📝 እጅግ ጥሩ! እባኮትን የእርስዎን *ስም* ይላኩ።",
    'button_register': "📝 መመዝገብ", 
    'button_commission': "💸 ስለ ኮሚሽን መረጃ", 
    'button_marketing': "📈 የገበያ መሳሪያዎች", 
    'button_faq': "❓ ተደጋጋሚ ጥያቄዎች", 
    'button_support': "📞 ድጋፍ",  
    'button_back': "🔙 ተመለስ",
    "button_main_menu": "🏠 ዋና ምናሌ",
    'error_empty_first_name': "❌ ስም ባዶ ሊሆን አይችልም። እባኮትን የእርስዎን *ስም* ያስገቡ።",
    'error_empty_last_name': "❌ የአባት ስም ባዶ ሊሆን አይችልም። እባኮትን የእርስዎን *የአባት ስም* ያስገቡ።",
    'ask_last_name': "📝 እጅግ ጥሩ! እባኮትን የእርስዎን *የአባት ስም* ይላኩ።",
    'ask_telegram_username': "📛 እጅግ ጥሩ! እባኮትን የቴሌግራም *መጠቀሚያ ስም* ይላኩ።",
    'error_invalid_telegram': "❌ የቴሌግራም መጠቀሚያ ስም መሆኑ እንደ '@' መጀመር አለበት። እባኮትን ትክክለኛ መጠቀሚያ ስም ያስገቡ።",
    'ask_email': "📧 እባኮትን የእርስዎን *ኢሜይል አድራሻ* ይላኩ።",
    'error_invalid_email': "❌ የኢሜይል አድራሻ ትክክል አይደለም። እባኮትን ትክክለኛ ኢሜይል ያስገቡ።",
    'ask_phone_number': "📱 እባኮትን የእርስዎን *ስልክ ቁጥር* ይላኩ።",
    'error_invalid_phone': "❌ የስልክ ቁጥር በቁጥር ብቻ መሆን እና በ7 እና 15 ቁጥሮች መካከል መሆን አለበት። እባኮትን ትክክለኛ ስልክ ቁጥር ያስገቡ።",
    'ask_country': "🌍 እባኮትን *ሃገርን* ይላኩ።",
    'error_invalid_country': "❌ የሃገር ስም በፊደል ብቻ መሆን አለበት። እባኮትን ትክክለኛ ሃገር ያስገቡ።",
    'ask_promo_code': "🎫 በመጨረሻ፣ የእርስዎን ተመካኝ *ኮድ* ይላኩ። (ምሳሌ: 'Linebet2024')",
    "manual_register_instruction": "🔗 *ለመለያየት በማስተካከል ለመመዝገብ ከተመረጡ ስለሆነ እናመሰግናለን!*\n\n"
                               "እባክዎን ይህን አገናኝ በመጠቀም ይመዝገቡ፡፡ [እዚህ ይመዝገቡ](https://lb-aff.com/L?tag=d_3895532m_22613c_ref&site=3895532&ad=22613&r=sign-up).\n\n"
                               "ከመመዝገቡ በኋላ፣ እባክዎን የሚከተሉትን መረጃዎች ወደ [@aff_lb_a](https://t.me/aff_lb_a) ያስገቡ፡፡\n\n"
                               "📄 *የሚያስፈልጉ መረጃዎች:*\n"
                               "1. *ሙሉ ስም:*\n"
                               "2. *በተለጋራም የተጠቃሚ ስም:*\n"
                               "3. *ኢሜይል:*\n"
                               "4. *ስልክ ቁጥር:*\n"
                               "5. *አገር:*\n"
                               "6. *የእርስዎ የተመረጡ ፕሮሞ ኮድ:*\n\n"
                               "*📌 ማስታወሻ:* ነጥብ 6 ስለ ፕሮሞሽናል ኮድዎ (PromoCode) ይወሰናል። እንደ \"Amro05\" ያሉ ማንኛውንም ፕሮሞ ኮድ ማምረጥ በነፃ ነው።\n\n"
                               "*ለማጋራጥ ስለሚያስፈልጋችሁ እናመሰግናለን!*",

    # 'manual_register_link': "🔗 እባኮትን ከዚህ አገናኝ ይጠቀሙ ለመመዝገብ: [እዚህ ይመዝግቡ](https://lb-aff.com/L?tag=d_3895532m_22613c_ref&site=3895532&ad=22613&r=sign-up)",
    'invalid_option': "❌ እባኮትን ትክክለኛ አማራጭ ከምናሌ ይምረጡ።",
    'registration_success': "✅ ስለምዝገባዎ እናመሰግናለን! የእኛ ቡድን ዝርዝሮችዎን ያሳርፍና በቅርቡ ያነጋግርዎታል።",
    'commission': "💸 *የኮሚሽን መዋቅር:*\n\n"
                  "👥 6-25 ተጫዋቾች: *35% ኮሚሽን*\n"
                  "👥 26-50 ተጫዋቾች: *40% ኮሚሽን*\n"
                  "👥 51-75 ተጫዋቾች: *45% ኮሚሽን*\n"
                  "👥 76+ ተጫዋቾች: *50% ኮሚሽን*\n\n"
                  "🗓️ ኮሚሽኖችን በየሳምንቱ መኖር ተከትሎ በማክሰኞ ይከፈላል።",
    'marketing_tips': "📈 *የገበያ መሳሪያዎች:*\n\n"
                      "1️⃣ ሪፈራል አገናኝዎን በስፖርትና በነገር ቡድኖች ውስጥ ያካፍሉ።\n"
                      "2️⃣ ማህበራዊ ድርጅቶችን ለማዳረስ ይጠቀሙ።\n"
                      "3️⃣ ምክር ይሰጡ ወይም የጨዋታ ማዘመን ይስጡ ሰልፍ ለማስተላለፍ።\n"
                      "4️⃣ እቃዎትን ከተነሳስል ግብረ-ክርክር ጋር ያካፍሉ።",
    'faq': "❓ *ተደጋጋሚ ጥያቄዎች:*\n\n"
           "💰 *እንዴት ገንዘብ እነርሳለሁ?*\n"
           "እርስዎ ተጫዋቾችን እንደቀን ተጭኖችን ተጭኖ ነበልባሌው ያስገቡታል።\n\n"
           "💸 *መታደስ ተስተንተናት?*\n"
           "በየሳምንቱ የእንቅስቃሴ ማክሰኞና ከ30 ድምር አስተዳድር።\n\n"
           "🎯 *እንደማታደስ እንዲሆን ያዝነችው?*\n"
           "የማህበራዊ አሰፈንጠሮችን የምልላሽ እና የማስታወቂያ ማህበረሰቦችን ይለጥፉ።",
    'support': "📞 ለድጋፍ፣ እባኮትን በቴሌግራም ያነጋግሩን: [@Linebet_globe](https://t.me/Linebet_globe).",
    'menu_buttons': [
        ['📝 መመዝገብ', '💸 ስለ ኮሚሽን መረጃ'],
        ['📈 የገበያ መሳሪያዎች', '❓ ተደጋጋሚ ጥያቄዎች'],
        ['📞 ድጋፍ', '🔙 ተመለስ']
    ],
    'after_registration_contact': "✅ እናመሰግናለን! ሂደት ለማጠናቀቅ በቅርቡ እናነጋግርሃለን።"
}
