# Russian
texts = {
    'welcome': "🎉 Добро пожаловать в партнерскую программу Linebet! 🎉",
    'language_prompt': "Пожалуйста, выберите ваш язык:",
    'main_menu_prompt': "Выберите опцию:",
    'languages': [
        ['🇬🇧 English', '🇫🇷 Français', '🇦🇪 العربية'],
        ['🇷🇺 Русский', '🇮🇷 فارسی', '🇰🇪 Kiswahili'],
        ['🇳🇬 Hausa', '🇪🇹 አማርኛ', '🇿🇦 isiZulu'],
        ['🇳🇬 Igbo']
    ],    'registration_choice': "Как вы хотите зарегистрироваться?\n\n"
                           "🌐 *Зарегистрироваться вручную*: Мы предоставим вам ссылку для регистрации.\n"
                           "🤖 *Пошаговая регистрация*: Укажите свои данные здесь, и мы зарегистрируем вас.",
    'button_register_manually': "🌐 Зарегистрироваться вручную",
    'button_register_step': "🤖 Пошаговая регистрация",
    'ask_first_name': "📝 Отлично! Как ваше *имя*?",
    'button_register': "📝 Регистрация", 
    'button_commission': "💸 Информация о комиссиях", 
    'button_marketing': "📈 Советы по маркетингу", 
    'button_faq': "❓ Часто задаваемые вопросы", 
    'button_support': "📞 Поддержка",  
    'button_back': "🔙 Назад",
    "button_main_menu": "🏠 Главное меню",
    'error_empty_first_name': "❌ Имя не может быть пустым. Укажите ваше *имя*.",
    'error_empty_last_name': "❌ Фамилия не может быть пустой. Укажите вашу *фамилию*.",
    'ask_last_name': "📝 Отлично! Как ваша *фамилия*?",
    'ask_telegram_username': "📛 Отлично! Какой ваш *Telegram-логин*?",
    'error_invalid_telegram': "❌ Логин Telegram должен начинаться с '@'. Укажите правильный логин.",
    'ask_email': "📧 Какой ваш *адрес электронной почты*?",
    'error_invalid_email': "❌ Неправильный адрес электронной почты. Укажите действующий адрес.",
    'ask_phone_number': "📱 Какой ваш *номер телефона*?",
    'error_invalid_phone': "❌ Номер телефона должен быть числовым и содержать от 7 до 15 цифр. Укажите действительный номер.",
    'ask_country': "🌍 В какой *стране* вы проживаете?",
    'error_invalid_country': "❌ Название страны должно содержать только буквы. Укажите правильную страну.",
    'ask_promo_code': "🎫 Наконец, какой ваш *промо-код* (например, 'Linebet2024')?",
    'manual_register_link': "🔗 Пожалуйста, используйте эту ссылку для регистрации: [Регистрация здесь](https://lb-aff.com/L?tag=d_3895532m_22613c_ref&site=3895532&ad=22613&r=sign-up)",
    'invalid_option': "❌ Пожалуйста, выберите правильный вариант из меню.",
    'registration_success': "✅ Спасибо за регистрацию! Наша команда проверит ваши данные и скоро свяжется с вами.",
    'commission': "💸 *Структура комиссий:*\n\n"
                  "👥 6-25 игроков: *35% комиссии*\n"
                  "👥 26-50 игроков: *40% комиссии*\n"
                  "👥 51-75 игроков: *45% комиссии*\n"
                  "👥 76+ игроков: *50% комиссии*\n\n"
                  "🗓️ Комиссии выплачиваются *еженедельно* по вторникам.",
    'marketing_tips': "📈 *Советы по маркетингу:*\n\n"
                      "1️⃣ Делитесь своей реферальной ссылкой в спортивных и игровых группах.\n"
                      "2️⃣ Используйте социальные сети для охвата заинтересованной аудитории.\n"
                      "3️⃣ Публикуйте советы или обновления матчей, чтобы привлечь подписчиков.\n"
                      "4️⃣ Акцентируйте свои усилия на крупных спортивных событиях, чтобы привлечь больше игроков.",
    'faq': "❓ *Часто задаваемые вопросы:*\n\n"
           "💰 *Как я зарабатываю деньги?*\n"
           "Вы зарабатываете комиссии от ставок игроков, которых вы привлекли.\n\n"
           "💸 *Когда я получу деньги?*\n"
           "Выплаты осуществляются еженедельно, каждый вторник, если ваш баланс превышает $30.\n\n"
           "🎯 *Какие инструменты я получаю?*\n"
           "Мы предоставляем баннеры, видео и реферальные ссылки для маркетинга.",
    'support': "📞 Для поддержки свяжитесь с нами в Telegram: [@aff_lb_a](https://t.me/aff_lb_a).",
    'menu_buttons': [
        ['📝 Регистрация', '💸 Информация о комиссиях'],
        ['📈 Советы по маркетингу', '❓ Часто задаваемые вопросы'],
        ['📞 Поддержка', '🔙 Назад']
    ],
    'after_registration_contact': "✅ Спасибо! Мы свяжемся с вами в ближайшее время для завершения процесса."
}
